""" 1)   Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10."""
i = 0
while i < 11:
    print(i)
    i += 1

""" 2)	 Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1."""
i = 20
while i > 0:
    print(i)
    i -= 1
